// Дано натуральное число N. Вывести на экран числа от 1 до N. Например N = 4, -> 1, 2, 3, 4.
int N = 25;
int i = 1;

while (i <= N)
{
    //Console.WriteLine(i);

    //Console.Write(i);
    //Console.Write(" ");

    Console.Write($"{i} ");

    //i = i + 1;
    
    i++;
}